In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("downloads/Multiple-Linear-Regression-master/50_Startups.csv")
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [3]:
df.shape

(50, 5)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   R&D Spend        50 non-null     float64
 1   Administration   50 non-null     float64
 2   Marketing Spend  50 non-null     float64
 3   State            50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [5]:
df.describe()

           R&D Spend  Administration  Marketing Spend         Profit
count      50.000000       50.000000        50.000000      50.000000
mean    73721.615600   121344.639600    211025.097800  112012.639200
std     45902.256482    28017.802755    122290.310726   40306.180338
min         0.000000    51283.140000         0.000000   14681.400000
25%     39936.370000   103730.875000    129300.132500   90138.902500
50%     73051.080000   122699.795000    212716.240000  107978.190000
75%    101602.800000   144842.180000    299469.085000  139765.977500
max    165349.200000   182645.560000    471784.100000  192261.830000

In [6]:
# df.isnull()
# df.isnull
df.nunique()

R&D Spend          49
Administration     50
Marketing Spend    48
State               3
Profit             50
dtype: int64

In [7]:
df['State'].unique()

array(['New York', 'California', 'Florida'], dtype=object)

In [8]:
state_grp = df.groupby("State")

In [9]:
for State, State_df in state_grp:
    print(State)
    print(State_df)

California
    R&D Spend  Administration  Marketing Spend       State     Profit
1   162597.70       151377.59        443898.53  California  191792.06
6   134615.46       147198.87        127716.82  California  156122.51
9   123334.88       108679.17        304981.62  California  149759.96
11  100671.96        91790.61        249744.55  California  144259.40
13   91992.39       135495.07        252664.93  California  134307.35
16   78013.11       121597.55        264346.06  California  126992.93
20   76253.86       113867.30        298664.47  California  118474.03
25   64664.71       139553.16        137962.62  California  107404.34
32   63408.86       129219.61         46085.25  California   97427.84
34   46426.07       157693.92        210797.67  California   96712.80
37   44069.95        51283.14        197029.42  California   89949.14
39   38558.51        82982.09        174999.30  California   81005.76
40   28754.33       118546.05        172795.67  California   78239.91
42   23640.93        96189.63        148001.11  California   71498.49
44   22177.74       154806.14         28334.72  California   65200.33
47       0.00       135426.92             0.00  California   42559.73
49       0.00       116983.80         45173.06  California   14681.40
Florida
    R&D Spend  Administration  Marketing Spend    State     Profit
2   153441.51       101145.55        407934.54  Florida  191050.39
4   142107.34        91391.77        366168.42  Florida  166187.94
7   130298.13       145530.06        323876.68  Florida  155752.60
10  101913.08       110594.11        229160.95  Florida  146121.95
12   93863.75       127320.38        249839.44  Florida  141585.52
14  119943.24       156547.42        256512.92  Florida  132602.65
18   91749.16       114175.79        294919.57  Florida  124266.90
22   73994.56       122782.75        303319.26  Florida  110352.25
23   67532.53       105751.03        304768.73  Florida  108733.99
26   75328.87       144135.98        134050.07  Florida  105733.54
28   66051.52       182645.56        118148.20  Florida  103282.38
30   61994.48       115641.28         91131.24  Florida   99937.59
33   55493.95       103057.49        214634.81  Florida   96778.92
36   28663.76       127056.21        201126.82  Florida   90708.19
41   27892.92        84710.77        164470.71  Florida   77798.83
46    1315.46       115816.21        297114.46  Florida   49490.75
New York
    R&D Spend  Administration  Marketing Spend     State     Profit
0   165349.20       136897.80        471784.10  New York  192261.83
3   144372.41       118671.85        383199.62  New York  182901.99
5   131876.90        99814.71        362861.36  New York  156991.12
8   120542.52       148718.95        311613.29  New York  152211.77
15  114523.61       122616.84        261776.23  New York  129917.04
17   94657.16       145077.58        282574.31  New York  125370.37
19   86419.70       153514.11             0.00  New York  122776.86
21   78389.47       153773.43        299737.29  New York  111313.02
24   77044.01        99281.34        140574.81  New York  108552.04
27   72107.60       127864.55        353183.81  New York  105008.31
29   65605.48       153032.06        107138.38  New York  101004.64
31   61136.38       152701.92         88218.23  New York   97483.56
35   46014.02        85047.44        205517.64  New York   96479.51
38   20229.59        65947.93        185265.10  New York   81229.06
43   15505.73       127382.30         35534.17  New York   69758.98
45    1000.23       124153.04          1903.93  New York   64926.08
48     542.05        51743.15             0.00  New York   35673.41

In [10]:
df1 = state_grp.get_group("California")
df1.head()

    R&D Spend  Administration  Marketing Spend       State     Profit
1   162597.70       151377.59        443898.53  California  191792.06
6   134615.46       147198.87        127716.82  California  156122.51
9   123334.88       108679.17        304981.62  California  149759.96
11  100671.96        91790.61        249744.55  California  144259.40
13   91992.39       135495.07        252664.93  California  134307.35

In [11]:
df1.shape

(17, 5)

In [12]:
x = df.iloc[:, :-1] ##independent features
y = df.iloc[:,-1] ## dependent feature = profit

In [13]:
x.head()

   R&D Spend  Administration  Marketing Spend       State
0  165349.20       136897.80        471784.10    New York
1  162597.70       151377.59        443898.53  California
2  153441.51       101145.55        407934.54     Florida
3  144372.41       118671.85        383199.62    New York
4  142107.34        91391.77        366168.42     Florida

In [14]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [15]:
states = pd.get_dummies(x['State'], drop_first = True)
# drop_first = we use to prevent from dummy trap

In [16]:
states.head()

   Florida  New York
0        0         1
1        0         0
2        1         0
3        0         1
4        1         0

In [17]:
x = x.drop('State', axis = 1)

In [18]:
x.head()

   R&D Spend  Administration  Marketing Spend
0  165349.20       136897.80        471784.10
1  162597.70       151377.59        443898.53
2  153441.51       101145.55        407934.54
3  144372.41       118671.85        383199.62
4  142107.34        91391.77        366168.42

In [19]:
x = pd.concat([x, states], axis = 1)

In [20]:
x.head()

   R&D Spend  Administration  Marketing Spend  Florida  New York
0  165349.20       136897.80        471784.10        0         1
1  162597.70       151377.59        443898.53        0         0
2  153441.51       101145.55        407934.54        1         0
3  144372.41       118671.85        383199.62        0         1
4  142107.34        91391.77        366168.42        1         0

In [22]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.2, random_state = 0)

In [23]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

regressor.fit(x_train, y_train)

LinearRegression()

In [27]:
y_pred = regressor.predict(x_test)
# predicting the test result

In [25]:
y_pred

array([103015.20159796, 132582.27760816, 132447.73845174,  71976.09851258,
       178537.48221055, 116161.24230165,  67851.69209676,  98791.73374687,
       113969.43533012, 167921.0656955 ])

In [26]:
y_test

28    103282.38
11    144259.40
10    146121.95
41     77798.83
2     191050.39
27    105008.31
38     81229.06
31     97483.56
22    110352.25
4     166187.94
Name: Profit, dtype: float64

In [29]:
# comparing our pred-value from the actual values
# we use r-squared method

In [32]:
from sklearn.metrics import r2_score
score = r2_score(y_test, y_pred)

In [33]:
score

0.9347068473282423

In [ ]:
# it shows score value is near to the 1 so our model is predicting better results